
jcmd是发送诊断命令到JVM，指令主要分为以下几个功能，控制JFR，问题定位，诊断JVM。但是该命令必须和JVM运行在一台机器上，并且是相同的用户。

输入命令
```
jcmd <process id/main class> PerfCounter.print
```
可以查看进程中的性能计数器。

命令模板：
```
jcmd <process id/main class> <command> [options]
```

Example 2-1 jcmd命令行：
```
> jcmd
5485 sun.tools.jcmd.JCmd
2125 MyProgram
 
> jcmd MyProgram help (or "jcmd 2125 help")
2125:
The following commands are available:
JFR.stop
JFR.start
JFR.dump
JFR.check
VM.native_memory
VM.check_commercial_features
VM.unlock_commercial_features
ManagementAgent.stop
ManagementAgent.start_local
ManagementAgent.start
Thread.print
GC.class_stats
GC.class_histogram
GC.heap_dump
GC.run_finalization
GC.run
VM.uptime
VM.flags
VM.system_properties
VM.command_line
VM.version
help
 
> jcmd MyProgram help Thread.print
2125:
Thread.print
Print all threads with stacktraces.
 
Impact: Medium: Depends on the number of threads.
 
Permission: java.lang.management.ManagementPermission(monitor)
 
Syntax : Thread.print [options]
 
Options: (options must be specified using the <key> or <key>=<value> syntax)
        -l : [optional] print java.util.concurrent locks (BOOLEAN, false)
 
> jcmd MyProgram Thread.print
2125:
2014-07-04 15:58:56
Full thread dump Java HotSpot(TM) 64-Bit Server VM (25.0-b69 mixed mode):
...
```

###### 2.6.1 使用jcmd命令
hotspot vm每个版本的命令行可能存在不同，因此，使用`jcmd <process id/main class> help`是查看选项的最好的方式。下面介绍几个使用方法。
- 打印hotspot和JDK的版本：`jcmd <process id/main class> VM.version`
- 打印所有系统参数(可能存在几百行)：`jcmd <process id/main class> VM.system_properties`
- 打印VM中的所有开关(即便没设置，有一些开关也会打印)：`jcmd <process id/main class> VM.flags`
- 打印启动时间：`jcmd <process id/main class> VM.uptime`
- 输出类直方图，结果冗长最好是重定向到文件当中。输出结果占用内存最多的会在顶部，整体按照倒序排列。`jcmd <process id/main class> GC.class_histogram`
- 创建堆直方图:`jcmd <process id/main class> GC.class_histogram filename=Myheaphistogram`。该命令与使用`jmap -histo pid`相同，但是我们推荐使用`jcmd`。
- dump堆内存:`jcmd <process id/main class> GC.heap_dump filename=MyheapDump`。该命令与使用`jmap -dump:file=<file> <pid>`相同，但是我们推荐使用`jcmd`.
-  打印线程栈：`jcmd <process id/main class> Thread.print`


###### 2.6.2 使用jcmd定位问题
- 开始记录

例如，对正在运行的7060进程执行2分钟的飞行记录，然后将记录保存到myrecoding.jfr中。查看如下指令：
```
jcmd 7060 JFR.start name=MyRecording settings=profile delay=20s duration=2m filename=C:\TEMP\myrecording.jfr
```

- 检查一个记录

`JFR.check`命令用来检查一个执行中的记录，例如：
```
jcmd 7060 JFR.check
```

- 停止一个记录

`JFR.stop`命令用来停止一个记录，并且销毁记录数据。例如：
```
jcmd 7060 JFR.stop
```

- dump记录

`JFR.dump`命令用来停止一个运行的recoding并且将recordings dump出文件。例如：

```
jcmd 7060 JFR.dump name=MyRecording filename=C:\TEMP\myrecording.jfr
```

- dump一个堆内存

比较好的dump堆内存的方式
```
jcmd <pid> GC.heap_dump filename=myheapdump
```

- 创建堆直方图
```
jcmd <pid> GC.class_histogram filename=myheaphistogram
```








